README.md

# Table of Contents

1.  [Programming](#org9ab8e3c)
    1.  [General](#org8479666)
    2.  [Git](#orgfd56347)
    3.  [Functional Programming](#org944020b)
    4.  [Distributed Systems](#org1eab93d)
    5.  [Python](#org12a6c31)
    6.  [Clojure](#org2442848)
    7.  [Swift](#orgc2ed732)
    8.  [Databases](#org62ccdef)
    9.  [Web](#org4422a1f)
    10. [Funny](#orgc48b364)
2.  [Data Science](#org6eee9a7)
    1.  [General](#orgc8e274f)
    2.  [MLOps](#org60795a1)
    3.  [Viz](#orgae214eb)
    4.  [Database](#org4428cb2)
    5.  [Functional](#orgfa7daf6)
    6.  [DS4A](#org6f0efda)
    7.  [Models](#org4ce40e4)
3.  [Data Engineering](#orgd643238)
    1.  [General](#orgc503796)
    2.  [Google Certification](#orge2c5b19)
4.  [Emacs](#org738d6ae)
    1.  [Jupyter](#org459c630)
5.  [Linux](#org63b8cda)
6.  [Life](#org326d89c)
7.  [Etc](#org46a68bc)
    1.  [Useful/cool Software](#orgf275ff4)



<a id="org9ab8e3c"></a>

# Programming


<a id="org8479666"></a>

## General

[FizzBuzz in too much detail](https://www.tomdalling.com/blog/software-design/fizzbuzz-in-too-much-detail/)
[100 opinions on programming](https://twitter.com/Conaw/status/1206036267185500161)
[Design Patterns](https://refactoring.guru/pt-br/design-patterns/python)
[The 10 Operating System Concepts Software Developers Need to Remember](https://medium.com/cracking-the-data-science-interview/the-10-operating-system-concepts-software-developers-need-to-remember-480d0734d710)


<a id="orgfd56347"></a>

## Git

[Never rebase at Master](https://stackoverflow.com/questions/40551486/duplicate-commits-after-rebase-have-been-merged-into-the-develop-branch)


<a id="org944020b"></a>

## Functional Programming

[Complexity and Functional Programming](https://kentcdodds.com/blog/classes-complexity-and-functional-programming)
[Functional programming design patterns by Scott Wlaschin
](https://youtu.be/E8I19uA-wGY)[Functional Programming in Scala](https://www.oreilly.com/library/view/functional-programming-in/9781617290657/)
[An Introduction to Functional Programming, Lazy Evaluation, and Streams in Python](https://yardsale8.github.io/stat489_book/index.html)
[fklearn](https://medium.com/building-nubank/introducing-fklearn-nubanks-machine-learning-library-part-i-2a1c781035d0)
[Understanding Transducers Through Python](http://sixty-north.com/blog/series/understanding-transducers-through-python)
[Right and left folds, primitive recursion patterns in Python and Haskell](https://eli.thegreenplace.net/2017/right-and-left-folds-primitive-recursion-patterns-in-python-and-haskell/)
[Classes vs Modules](https://softwareengineering.stackexchange.com/questions/329348/classes-vs-modules-in-python)
[Domain Driven Design](https://fsharpforfunandprofit.com/ddd/)
[Solving Problems the Clojure Way - Rafal Dittwald](https://youtu.be/vK1DazRK_a0)
[OOP Theory vs Reality](https://www.reddit.com/r/ProgrammerHumor/comments/418x95/theory_vs_reality/)
[Object Oriented Programming is an expensive disaster which must end](http://www.smashcompany.com/technology/object-oriented-programming-is-an-expensive-disaster-which-must-end)
[Object-Oriented Programming - The Trillion Dollar Disaster](https://medium.com/better-programming/object-oriented-programming-the-trillion-dollar-disaster-92a4b666c7c7)
[Goodbye, Object Oriented Programming](https://medium.com/@cscalfani/goodbye-object-oriented-programming-a59cda4c0e53)
[Functional Programming Patterns Cookbook (JavaScript)](https://medium.com/free-code-camp/functional-programming-patterns-cookbook-3a0dfe2d7e0a)


<a id="org1eab93d"></a>

## Distributed Systems

[How to Diminish the Inevitable Failure of Distributed Systems](https://thenewstack.io/how-to-diminish-the-inevitable-failure-of-distributed-systems/)
[Designing Data-Intensive Applications](https://dataintensive.net/)
[Distributed Systems for Fun and For Profit](http://book.mixu.net/distsys/)


<a id="org12a6c31"></a>

## Python

[Poetry](https://python-poetry.org/)
[Deployment of Machine Learning Models](https://www.udemy.com/course/deployment-of-machine-learning-models/?start=0)
[Is Recursion Bad In Python?](https://beapython.dev/2020/05/14/is-recursion-bad-in-python/)


<a id="org2442848"></a>

## Clojure

[Clojure and types](https://lispcast.com/clojure-and-types/)
[Clojure Style Guide](https://guide.clojure.style/)
[Geni - Clojure Dataframes](https://github.com/zero-one-group/geni)
[Sparkling - Clojure + Spark](http://gorillalabs.github.io/sparkling/)
[Reveal: Read Eval Visualize Loop for Clojure](https://github.com/vlaaad/reveal)
[Intro to Data Science in Clojure with Incanter and Gorilla REPL](https://github.com/drewnoff/openintro-gorilla-incanter)
[A whiff of data science in Clojure](https://jstaffans.github.io/posts/2017-11-14-clojure-data-science.html)


<a id="orgc2ed732"></a>

## Swift

[Swift Numerics](https://www.fast.ai/2019/01/10/swift-numerics/)


<a id="org62ccdef"></a>

## Databases

[Datahike](https://alekcz.gitbook.io/datahike-tuts/appendix/videos-to-worth-watching)


<a id="org4422a1f"></a>

## Web

[Netlify](https://www.netlify.com/)
[Running a Blog with Hugo, Emacs, and Netlify](https://600000.ml/post/building_blog_with_hugo_emacs_netlify/)


<a id="orgc48b364"></a>

## Funny

[A Brief, Incomplete, and Mostly Wrong History of Programming Languages](http://james-iry.blogspot.com/2009/05/brief-incomplete-and-mostly-wrong.html)


<a id="org6eee9a7"></a>

# Data Science


<a id="orgc8e274f"></a>

## General

[How does science really work](https://www.newyorker.com/magazine/2020/10/05/how-does-science-really-work)
[How to write a great research paper](https://youtu.be/uuoZ3becbXU)
[From Astronomy to Data Science](https://www.deepdyve.com/lp/springer-journals/from-astronomy-to-data-science-dJQ7A9ucii)
[Google&rsquo;s Datasetsearch](https://datasetsearch.research.google.com/)
[120 Data Science Interview Questions](https://github.com/kojino/120-Data-Science-Interview-Questions)
[Data Science Interviews](https://github.com/alexeygrigorev/data-science-interviews)
[A Brief History of Liv Up’s Data Platform](https://medium.com/liv-up-inside-the-kitchen/a-brief-history-of-liv-up-data-platform-5ac403644c1c)


<a id="org60795a1"></a>

## MLOps

[CD4ML](https://martinfowler.com/articles/cd4ml.html)
[MLOps](https://ml-ops.org/)
[End to end ML workflow](https://ml-ops.org/content/end-to-end-ml-workflow)
[MLFlow vs Kubeflow](https://medium.com/weareservian/the-cheesy-analogy-of-mlflow-and-kubeflow-715a45580fbe)
[Demystifying the AI Infrastructure Stack](https://www.intel.com/content/www/us/en/intel-capital/news/story.html?id=a0F1I00000BNTXPUA5#/type=All/page=0/term=/tags=)
[Introduction to data pipelines and Kedro](https://www.youtube.com/watch?v=rf8yBHsDOj4&list=PLTU89LAWKRwEdiDKeMOU2ye6yU9Qd4MRo)


<a id="orgae214eb"></a>

## Viz

[Streamlit](https://github.com/streamlit/streamlit)
[Redash](https://redash.io/)
 [Redash Query Filters](https://redash.io/help/user-guide/querying/query-filters)
 [Redash Query Parameters](https://redash.io/help/user-guide/querying/query-parameters)
[Metabase](https://www.metabase.com/)
 [Metabase Query Parameters](https://www.metabase.com/docs/latest/users-guide/13-sql-parameters.html)
 [Metabase Filters](https://www.metabase.com/docs/latest/users-guide/08-dashboard-filters.html)
[Apache Superset](https://superset.incubator.apache.org/)
[Plotly Dash](https://dash.plotly.com/)
[Open Source Embedded Analytics](https://medium.com/@eponkratova/iframe-src-open-source-embedded-analytics-for-saas-iframe-224a66e9b006)


<a id="org4428cb2"></a>

## Database

[7 Database Paradigms](https://www.youtube.com/watch?v=W2Z7fbCLSTw)
[Open Distro for Elasticsearch](https://opendistro.github.io/for-elasticsearch/)
[OLAP cube with Elasticsearch](https://malike.github.io/OLAP-Cube-With-Elasticsearch.html)


<a id="orgfa7daf6"></a>

## Functional

[fklearn](https://medium.com/building-nubank/introducing-fklearn-nubanks-machine-learning-library-part-i-2a1c781035d0)


<a id="org6f0efda"></a>

## DS4A

[Matéria DS4A](https://neofeed.com.br/blog/home/no-softbank-a-aposta-em-inteligencia-artificial-comeca-na-base/)


<a id="org4ce40e4"></a>

## Models

[Estimating a Markov Transition Matrix from Observational Data](https://www.jstor.org/stable/2584334?seq=1)
[Markov Chains in Python](https://www.datacamp.com/community/tutorials/markov-chains-python-tutorial)
[Python Concurrent Futures](https://christophergs.com/python/2018/03/25/python-concurrent-futures/)


<a id="orgd643238"></a>

# Data Engineering


<a id="orgc503796"></a>

## General

[Principled Data Engineering, Part I: Architectural Overview](https://medium.com/ssense-tech/principled-data-engineering-part-i-architectural-overview-6d4bdf89b657)
[What is Data Engineering: Explaining the Data Pipeline, Data Warehouse, and Data Engineer Role](https://www.altexsoft.com/blog/datascience/what-is-data-engineering-explaining-data-pipeline-data-warehouse-and-data-engineer-role/)


<a id="orge2c5b19"></a>

## Google Certification

[Data Dossier - Cheat Sheet from Linux Academy](https://app.lucidchart.com/lucidchart/0ca44a63-4ea4-4d78-8367-2465512d21be/view?page=5CetVcvv3YSZ#)
[Sample questions](https://cloud.google.com/certification/sample-questions/data-engineer)


<a id="org738d6ae"></a>

# Emacs

[Cheatsheet](https://caiorss.github.io/Emacs-Elisp-Programming/Keybindings.html#sec-2)
[15 Reasons Why I Use Emacs, With GIFs](https://medium.com/better-programming/15-reasons-why-i-use-emacs-with-gifs-5b03c6608b61)
[Why I switched from VSCode to Emacs](https://hadi.timachi.com/2019/12/07/Why_I_switched_from_VScode_to_Emacs)
[Why Emacs](https://tecosaur.github.io/emacs-config/config.html)
[How do you create a robust Python IDE with Emacs (as the Text editor)](https://emacs.stackexchange.com/questions/9696/how-do-you-create-a-robust-python-ide-with-emacs-as-the-text-editor)
[A Baby Steps Guide to Managing Your Tasks with Org](http://emacslife.com/baby-steps-org.html#org63c0a18)
[An agenda for life with Org mode](https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html)
[How to create LaTeX documents in Emacs](https://opensource.com/article/18/4/how-create-latex-documents-emacs)
[Org Beamer Reference](https://github.com/fniessen/refcard-org-beamer)
[Awesome Doom Emacs config](https://tecosaur.github.io/emacs-config/config.html)


<a id="org459c630"></a>

## Jupyter

-   [Conda, Jupyter and Emacs](https://martinralbrecht.wordpress.com/2020/08/23/conda-jupyter-and-emacs/)
    -   [Reddit discussion](https://www.reddit.com/r/emacs/comments/if37r1/conda_jupyter_and_emacs_my_setup/)
-   [Replacing Jupyter with Orgmode](https://rgoswami.me/posts/jupyter-orgmode/)
    -   [Reddit discussion](https://www.reddit.com/r/orgmode/comments/frlgkh/replacing_jupyter_with_orgmode/)
-   [Any Emacs Ipython Notebook (EIN) users willing to share secrets?](https://www.reddit.com/r/emacs/comments/hk4fps/any_emacs_ipython_notebook_ein_users_willing_to/)
-   [ein or emacsjupyter users here?](https://www.reddit.com/r/emacs/comments/i5xagf/ein_or_emacsjupyter_users_here/)


<a id="org63b8cda"></a>

# Linux

[How do I free up disk space](https://askubuntu.com/questions/5980/how-do-i-free-up-disk-space)


<a id="org326d89c"></a>

# Life

[The Advantages of Closing a Few Doors](https://www.nytimes.com/2008/02/26/science/26tier.html)


<a id="org46a68bc"></a>

# Etc


<a id="orgf275ff4"></a>

## Useful/cool Software

[Ventoy - Bootable USB](https://github.com/ventoy/Ventoy)

